Repository: pingfangx/TranslatorX-other
Catalog: AndroidSdkDocs/tm/原.tmx
Source language: en_us
Languages: zh_cn

source: Annotations
zh_cn: 注解

source: Denotes that an integer parameter, field or method return value is expected
zh_cn: 表示一个整型参数，字段或方法的返回值，

source: Denotes that an integer parameter, field or method return value is expected to be a boolean resource reference.
zh_cn: 表示一个整型参数，字段或方法的返回值，预期是一个 boolean 资源引用。

source: Denotes that an integer parameter, field or method return value is expected to be a color resource reference (e.g.
zh_cn: 表示一个整型参数，字段或方法的返回值，预期是一个 color 资源引用。

source: Denotes that an integer parameter, field or method return value is expected to be a dimension resource reference (e.g.
zh_cn: 表示一个整型参数，字段或方法的返回值，预期是一个 dimension 资源引用。

source: Denotes that an integer parameter, field or method return value is expected to be a drawable resource reference (e.g.
zh_cn: 表示一个整型参数，字段或方法的返回值，预期是一个 drawable 资源引用。

source: Denotes that an integer parameter, field or method return value is expected to be a resource reference of any type.
zh_cn: 表示一个整型参数，字段或方法的返回值，预期是一个任意类型的资源引用。

source: Denotes that an integer parameter, field or method return value is expected to be an anim resource reference (e.g.
zh_cn: 表示一个整型参数，字段或方法的返回值，预期是一个 anim 资源引用。

source: Denotes that an integer parameter, field or method return value is expected to be an animator resource reference (e.g.
zh_cn: 表示一个整型参数，字段或方法的返回值，预期是一个 animator 资源引用。

source: Denotes that an integer parameter, field or method return value is expected to be an array resource reference (e.g.
zh_cn: 表示一个整型参数，字段或方法的返回值，预期是一个 array 资源引用。

source: Denotes that an integer parameter, field or method return value is expected to be an attribute reference (e.g.
zh_cn: 表示一个整型参数，字段或方法的返回值，预期是一个 attribute 资源。

source: Denotes that an integer parameter, field or method return value is expected to represent a dimension.
zh_cn: 表示一个整型参数，字段或方法的返回值，预期表示一个尺寸。

source: Denotes that any overriding methods should invoke this method as well.
zh_cn: 表示任何重写的方法也应该调用该方法。（译注：如Activity.onCreate）

source: Denotes that the annotated element represents a packed color int, AARRGGBB.
zh_cn: 表示所注解的元素表示一个包装的颜色整型, AARRGGBB.

source: Denotes that the annotated element should be a float or double in the given range
zh_cn: 表示所注解的元素应该是在指定范围内的 float 或 double

source: Denotes that the annotated method can be called from any thread (e.g.
zh_cn: 表示所注解的方法可以从任意线程调用 (e.g.

source: Denotes that the annotated method returns a result that it typically is an error to ignore.
zh_cn: 表示所注解的方法的返回值，如果被忽略通常会出错。（译注：如File.delete()）

source: Denotes that the annotated method should only be called on the binder thread.
zh_cn: 表示所注解的方法只应该在绑定线程被调用。

source: to be a fraction resource reference.
zh_cn: 预期是一个 fraction 资源引用。

source: to be an id resource reference (e.g.
zh_cn: 预期是一个 id 资源引用。
